src/cf/InformationRegisters/ор_ИсторияЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_ИсторияЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЗагружаемогоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыОшибок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФоноваяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НумераторСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_ИсторияЗагрузки/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	// Установка пустых значений отбора по периоду
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Дата('00010101'));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата()));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаЗагрузкиОтборПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"НастройкаЗагрузки",
		ЭтотОбъект["НастройкаЗагрузки"],
		ЗначениеЗаполнено(ЭтотОбъект["НастройкаЗагрузки"]));
		
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОшибкиОтборПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"СтатусОшибки",
		ЭтотОбъект["СтатусОшибки"],
		ЗначениеЗаполнено(ЭтотОбъект["СтатусОшибки"]));
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Контрагент",
		ЭтотОбъект["Контрагент"],
		ЗначениеЗаполнено(ЭтотОбъект["Контрагент"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектОтбораПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"Объект",
		ЭтотОбъект["ОбъектОтбора"],
		ЗначениеЗаполнено(ЭтотОбъект["ОбъектОтбора"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(ТекущаяДата())));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоФоновыеПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ИзменитьЭлементОтбораСписка(
		Список,
		"ФоноваяЗагрузка",
		ЭтотОбъект["ОтображатьТолькоФоновые"],
		ЗначениеЗаполнено(ЭтотОбъект["ОтображатьТолькоФоновые"]));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПросмотрЗаписи(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если НЕ ТекСтрока = Неопределено Тогда
		
		ПараметрыОткрытия = Новый Структура("Ключ", ТекСтрока);
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("РегистрСведений.ор_ИсторияЗагрузки.ФормаЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,,,Режим);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СократитьЖурнал(Команда)
	
	Если Не ДоступноСокращениеЖурнала() Тогда
		ПоказатьПредупреждение(,"Не установлено дополнительное право на использование данной возможности.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ОповещениеСократитьЖурналЗавершение",ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("РегистрСведений.ор_ИсторияЗагрузки.Форма.СокращениеЖурнала",,ЭтотОбъект,,,,ОбработкаОповещения,Режим);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДоступноСокращениеЖурнала()
	
	Возврат Пользователи.РолиДоступны("ор_ПравоРазрешитьСокращениеИсторииЗагрузки", Пользователи.ТекущийПользователь());
	
КонецФункции

&НаКлиенте
Процедура ОповещениеСократитьЖурналЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
